samples/ePA 1 Beispielnachrichten PS - Konnektor/Requests/retrievedocument-resp.xop

--_MIME_MTOM_Boundary_
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: 8bit
Content-ID: <Start@Request.konlan>

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:m0="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:m1="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:m2="http://ws.gematik.de/fa/phr/v1.1">
  <soap:Header>
    <m:ContextHeader xmlns:m="http://ws.gematik.de/conn/phrs/PHRService/v1.3">
      <m0:Context>
        <m1:MandantId>Mandant1</m1:MandantId>
        <m1:ClientSystemId>ClientID1</m1:ClientSystemId>
        <m1:WorkplaceId>CATS</m1:WorkplaceId>
      </m0:Context>
      <m:RecordIdentifier>
        <m2:InsurantId root="1.2.276.0.76.4.8" extension="X110473550"/>
        <m2:HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</m2:HomeCommunityId>
      </m:RecordIdentifier>
    </m:ContextHeader>
    <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RetrieveDocumentSet</Action>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://10.11.218.161:80/fm/phrservice</To>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">ec50fa1f-ff62-49d3-a870-f5218afba633</MessageID>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
  </soap:Header>
  <soap:Body>
    <RetrieveDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007">
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.315.3.2.1.1</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.315.3.2.1.1</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.17930.51373.54354.20040.33122.16728266.12168687</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.315.3.2.1.1</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.315.3.2.1.1</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.20502.5074.39693.19397.40947.3962341.16685811</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.32303.45978.3936.16765.40464.15881777.14966634</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.9931.19832.54409.18874.38942.14993508.6836922</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.24479.16830.19763.16970.44197.12958115.10621730</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.3750.34709.5633.16805.48169.5536134.13361538</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.3.6.1.4.1.21367.2020.3.186561647.2</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.32303.45978.3936.16765.40464.15881777.14966634</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.9931.19832.54409.18874.38942.14993508.6836922</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.24479.16830.19763.16970.44197.12958115.10621730</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.3750.34709.5633.16805.48169.5536134.13361538</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <HomeCommunityId>urn:oid:1.2.276.0.76.3.1.405</HomeCommunityId>
        <RepositoryUniqueId>1.2.276.0.76.3.1.405</RepositoryUniqueId>
        <DocumentUniqueId>1.3.6.1.4.1.21367.2020.3.186561647.2</DocumentUniqueId>
      </DocumentRequest>
    </RetrieveDocumentSetRequest>
  </soap:Body>
</soap:Envelope>

--_MIME_MTOM_Boundary_--
