samples/retrieve_req.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://xdsb.dew.org/XDSDocumentRepositoryRetrieve/RetrieveDocumentSet</To>
    <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RetrieveDocumentSet</Action>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
    <FaultTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </FaultTo>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:144e58eb-6c83-4fdd-b916-8b52d79afeb6</MessageID>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_024fe3a2cb34dcd0b4129907ab80082a" IssueInstant="2016-03-03T14:55:55.609Z" Version="2.0" xsi:schemaLocation="urn:oasis:names:tc:SAML:2.0:assertion saml-schema-assertion-2.0.xsd">
        <saml2:Issuer>120</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_024fe3a2cb34dcd0b4129907ab80082a">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>3WgMqQ8ziMXy2CVEzVDFOt/1J/k=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>B0W2q9tNF/xd5oOnzmLWepDXerCblLyFll2k2OXX6DYW2U2m1RBsrdlpjglaT94fMK5NNCPfnKoNaRymEQxjqy7yG87Jf9KptRrUaYpSxfKYKzfj7aZhcQTQr6lsWdX+L6boRvoIXaAvecm+RXge2YnAoBp7759s+yzifv7Dx0BgkUZ+DhgzU4rsfz71y4tYp4n8m7prnf15mG9JJsA5tIbRKZ8uVCJROBIakkjx9stsPAt744Ox7WXRv2eFQIRbrYrCV9NOaN0/ufS7YayrZqDPBw+LerRZkoPg0Kd880Nzzna36o2VaKGvuUgOc3VVvUNQFJuxWCvrst9PLTlJxQ==</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>
                MIID+zCCAuOgAwIBAgIBEjANBgkqhkiG9w0BAQsFADCBiDELMAkGA1UEBhMCSVQxETAPBgNVBAgT
                CENhbXBhbmlhMQ8wDQYDVQQHEwZOYXBvbGkxDDAKBgNVBAoTA0NOUjENMAsGA1UECxMESUNBUjEZ
                MBcGA1UEAxMQRlNFIFJPT1QgQ0EgVEVTVDEdMBsGCSqGSIb3DQEJARYObm9yZXBseUBjbnIuaXQw
                HhcNMTYwMjA4MDAwMDAwWhcNMzUxMjE3MjM1OTU5WjCBlzELMAkGA1UEBhMCSVQxDjAMBgNVBAgT
                BUxhemlvMQ0wCwYDVQQHEwRSb21hMRYwFAYDVQQKEw1SZWdpb25lIExhemlvMRYwFAYDVQQLEw1S
                ZWdpb25lIExhemlvMRAwDgYDVQQDEwdGU0UgTEFaMScwJQYJKoZIhvcNAQkBFhhub3JlcGx5QHJl
                Z2lvbmUubGF6aW8uaXQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCquIPCj64y90SZ
                p0r+KTip+TxHNHQkKIEKvScc4Seo02t/6U6r4Q14quc4K2gnvzlvPRV/Ly2VrKEVJOL5JFJ8vwjn
                JICX1KEuh+OqBRotNO9BAp1Zh8Roxb82Y+5Ce8eXdgicbeFPQ173TXIDaf+g+Rou+FGGShycjngG
                m1oQXw4tEnP/FVZpjstF9fy7jwaG2UnZX+9jxJZtNxlXj03Io8Ug5NVEiOMZ5/tqN9q33SYcYYd/
                gh0QRlXPjvwT6fhNyxB0zevGBJcENkgshYxPXO9p/jEpx5ifUZZsXNEMZrIb9db21wWPDaKhN4Ir
                +MpZtdU6eNIB/QGwoaMuJ5ADAgMBAAGjXzBdMAwGA1UdEwEB/wQCMAAwHQYDVR0OBBYEFBPo4oLk
                mH66i7Q6Jb2NqyGNMXXEMA4GA1UdDwEB/wQEAwIF4DAeBglghkgBhvhCAQ0EERYPeGNhIGNlcnRp
                ZmljYXRlMA0GCSqGSIb3DQEBCwUAA4IBAQCU8QdtsFyAOlo/736P7lUF8KZbTQnD+hhxJHK0OVSz
                dIJlH7wIMncW86h652dNHfDf4W0IwEASiz6mv4z6hG51KG7wPLGaqXQp8y42OjMq88iieBmNkluJ
                1Agnokw7N/bIoFvgpvb+3l/YKK5OqDzXyz46YmDbehrempoBYDK4mPlS4GAXfQ0nqItxD3RCkRUB
                h1+JUx+Dvc9UC+P0oU3ZjoAfp+wNletWGStXqHvRKjut7lwz8Ifh8BBkoSYBnkq6hgRIePiizROf
                KCKp9hIfR5C1xiPaeGqcNJfAyGgLFTlmrMCRZvptNMpR3ZOyYrn9XzVDON4Ox5Ri4O50GSMI
              </ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID>VRDMRC67T20I257E^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</saml2:NameID>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2016-03-03T13:55:55.609Z" NotOnOrAfter="2016-03-04T14:55:55.609Z"/>
        <saml2:AuthnStatement AuthnInstant="2016-03-03T14:55:55.609Z">
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:Kerberos</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">APR</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:environment:locality" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">120037</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">TREATMENT</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:resource:hl7:type" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">('60591-5^^2.16.840.1.113883.6.1','11502-2^^2.16.840.1.113883.6.1')</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">120</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">VRDMRC67T20I257E^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">Regione Lazio</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">RSSMRA75C03F839K^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:resource:patient:consent" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">true</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:action:action-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">READ</saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <RetrieveDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
      <DocumentRequest>
        <RepositoryUniqueId>2.16.840.1.113883.2.9.2.999.4.5.113883</RepositoryUniqueId>
        <DocumentUniqueId>2.16.840.1.113883.2.9.2.999.4.4^123456</DocumentUniqueId>
      </DocumentRequest>
    </RetrieveDocumentSetRequest>
  </soap:Body>
</soap:Envelope>